tap "caarlos0/tap"
tap "charmbracelet/tap"

brew "alejandra"
brew "bash"
brew "bash-completion@2"
brew "bash-language-server"
brew "direnv"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "git-lfs"
brew "go"
brew "go-task"
brew "goimports"
brew "gopls"
brew "htop"
brew "jq"
brew "librsvg"
brew "lua"
brew "nodejs"
brew "optipng"
brew "prettier"
brew "ripgrep"
brew "shellcheck"
brew "shfmt"
brew "stylua"
brew "svgo"
brew "taplo"
brew "tmux"
brew "tree"
brew "ttyd"
brew "vim"
brew "vscode-langservers-extracted"
brew "yaml-language-server"
brew "yarn"
brew "z.lua"
brew "zlib"

cask "1password"
cask "element"
cask "figma"
cask "firefox"
cask "ghostty"
cask "google-drive"
cask "kitty"
cask "linear-linear"
cask "monitorcontrol"
cask "rio"
cask "superhuman"
cask "telegram"
cask "whatsapp"

mas "Icon Slate", id: 439697913
mas "1Password for Safari", id: 1569813296
