brew "alejandra"
brew "bash"
brew "bash-completion@2"
brew "bash-language-server"
brew "brotli"
brew "container"
brew "coreutils"
brew "curl"
brew "curl"
brew "direnv"
brew "duf"
brew "elm"
brew "elm-format"
brew "ffmpeg"
brew "fzf"
brew "gcc"
brew "gh"
brew "git"
brew "git-lfs"
brew "gnu-sed"
brew "gnu-tar"
brew "gnupg"
brew "go-task"
brew "helix"
brew "htop"
brew "imagemagick"
brew "jq"
brew "kakoune"
brew "librsvg"
brew "lua-language-server"
brew "luajit"
brew "make"
brew "moreutils"
brew "nodejs"
brew "optipng"
brew "postgresql"
brew "prettier"
brew "python3"
brew "redis"
brew "ripgrep"
brew "rust"
brew "rust-analyzer"
brew "semgrep"
brew "shellcheck"
brew "shfmt"
brew "stylua"
brew "superhtml"
brew "svgo"
brew "taplo"
brew "tmux"
brew "tombi"
brew "tree"
brew "tree-sitter"
brew "ttyd"
brew "vscode-langservers-extracted"
brew "webp"
brew "wget"
brew "yaml-language-server"
brew "z.lua"
brew "zellij"
brew "zlib"
brew "zopfli"

brew "delve"
brew "gofumpt"
brew "goimports"
brew "golang"
brew "golangci-lint"
brew "golangci-lint-langserver"
brew "gopls"

brew "kakoune-lsp/kakoune-lsp/kakoune-lsp"

cask "1password"
cask "adobe-creative-cloud"
cask "airflow"
cask "blender"
cask "chatgpt"
cask "cleanshot"
cask "discord"
cask "docker-desktop"
cask "dropbox"
cask "element"
cask "figma"
cask "firefox"
cask "ghostty"
cask "google-drive"
cask "kitty"
cask "linear-linear"
cask "monitorcontrol"
cask "rio"
cask "slack"
cask "superhuman"
cask "telegram"
cask "visual-studio-code"
cask "whatsapp"

cask "font-ibm-plex-mono"
cask "font-ibm-plex-sans"
cask "font-inter"
cask "font-jetbrains-mono"

mas "1Password for Safari", id: 1569813296
mas "Compressor", id: 424390742
mas "Icon Slate", id: 439697913
mas "Microsoft Excel", id: 462058435
mas "Microsoft Word", id: 462054704
mas "NextDNS", id: 1464122853
mas "WhatsApp", id: 310633997
