tap "caarlos0/tap"
tap "charmbracelet/tap"

brew "tree"
brew "alejandra"
brew "bash"
brew "bash-completion@2"
brew "direnv"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "git-lfs"
brew "go"
brew "jq"
brew "lua"
brew "nodejs"
brew "optipng"
brew "ripgrep"
brew "shellcheck"
brew "shfmt"
brew "svgo"
brew "tmux"
brew "vim"
brew "yarn"
brew "z.lua"

cask "1password"
cask "figma"
cask "ghostty"
cask "google-drive"
cask "linear-linear"
cask "rio"
cask "superhuman"
cask "telegram"
cask "whatsapp"

mas "Icon Slate", id: 439697913
mas "1Password for Safari", id: 1569813296
