alsa-ucm-conf
amd-ucode
asusctl
base
base-devel
bash-completion
brightnessctl
btrfs-progs
cachyos-keyring
cachyos-mirrorlist
cachyos-v3-mirrorlist
cachyos-v4-mirrorlist
cliphist
cmake
direnv
discord
dolphin
duf
efibootmgr
feh
firefox
fuzzel
fwupd
ghostty
git
github-cli
git-lfs
go
gofumpt
go-task
gum
helix
htop
hypridle
hyprland
hyprlauncher
hyprlock
hyprpaper
hyprpolkitagent
hyprshot
iwd
jujutsu
kitty
layer-shell-qt
less
libinput-tools
linux
linux-cachyos
linux-cachyos-headers
linux-firmware
linux-firmware-mediatek
linux-g14
linux-g14-headers
linux-headers
mako
mesa
mise
mpv
neovim
networkmanager
nodejs
noto-fonts-emoji
npm
obsidian
openssh
optipng
otf-monaspace-nerdfonts
paru
pipewire
pipewire-alsa
pipewire-libcamera
pipewire-pulse
podman
podman-compose
podman-docker
postgresql
power-profiles-daemon
prettier
qt5-base
qt5-svg
qt5-wayland
qt6-wayland
quickshell
rio
ripgrep
rog-control-center
shellcheck
shfmt
sof-firmware
sof-tools
stylua
sudo
swaybg
tailscale
tmux
ttf-jetbrains-mono
unzip
vim
vulkan-radeon
wf-recorder
wireplumber
xdg-desktop-portal-hyprland
xorg-xrandr
zellij
zsh
